

//*****************************************************************************************************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************
//*************************************** src/components/Player.tsx ***********************************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************

"use client";

import React from "react";
import { PlayerState } from "../logic/types";
import "../styles/player.css";

type PlayerProps = {
  player: PlayerState;
  isActive: boolean;
};

export default function Player({ player, isActive }: PlayerProps) {
  // Первый игрок - красный, второй - синий
  const colorClass = player.colorClass ?? "default-color";

  return (
    <div className={`player-info ${colorClass} ${isActive ? "active" : ""}`}>
      <img 
      src={player.image} 
      alt={player.name} 
      style={{ width: "40px", height: "40px", marginRight: "10px" }}
      />
      <span>{player.name} (HP:{player.health}, Energy:{player.energy})</span>
    </div>
  );
}
