
//*****************************************************************************************************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************
//************************************************* src/logic/initialPlayers.ts ***********************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************
//*****************************************************************************************************************************

import { PlayerState } from "./types";

const initialPlayers: PlayerState[] = [
  {
    id: 0,
    name: "Player1",
    position: { x: 0, y: 0 },
    energy: 100,
    maxEnergy: 100,
    level: 1,
    experience: 0,
    maxExperience: 500,
    visionRange: 5,
    health: 100,
    maxHealth: 100,
    attack: 10,
    defense: 5,
    speed: 3,           
    maneuverability: 2, 
    vision: 5,
    image: "player-1.webp",

    // Новый формат inventory
    inventory: {
      resources: {},  // Пустой объект, без ресурсов изначально
      artifacts: {},  // Пустой объект, без артефактов изначально
    },
  },
  {
    id: 1,
    name: "Player2",
    position: { x: 19, y: 19 },
    energy: 100,
    maxEnergy: 100,
    level: 1,
    experience: 0,
    maxExperience: 500,
    visionRange: 3,
    vision: 5,
    health: 100,
    maxHealth: 100,
    attack: 10,
    defense: 5,
    speed: 3,            
    maneuverability: 2, 
    image: "player-2.webp",

    // Новый формат inventory
    inventory: {
      resources: {},
      artifacts: {},
    },
  },
];

export default initialPlayers;
